tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/services"
tap "pulumi/tap"

brew "xz"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "python@3.12"
brew "awscli"
brew "bat"
brew "bottom"
brew "btop"
brew "cloudflared"
brew "libgit2"
brew "exa"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "openjpeg"
brew "git"
brew "glib"
brew "shared-mime-info"
brew "libheif"
brew "liblqr"
brew "imagemagick"
brew "jless"
brew "jq"
brew "lazygit"
brew "libpq"
brew "luarocks"
brew "neovim"
brew "node"
brew "openssl"
brew "postgresql@14", restart_service: :changed
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "starship"
brew "tcl-tk"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "yamllint"
brew "zlib"
brew "zoxide"
brew "pulumi/tap/pulumi"

cask "fig"
cask "jordanbaird-ice"
cask "raycast"
