tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "bzip2"
brew "git"
brew "openssl@1.1"
brew "neovim"
brew "node"
brew "readline"
brew "postgresql"
brew "pyenv"
brew "rbenv"
brew "sqlite"
brew "xz"
brew "the_silver_searcher"
brew "tmux"
brew "zlib"
brew "heroku/brew/heroku"
cask "rectangle"
